W7D2/MusicApp/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1BlSR6BvaomH4VLgTYiGFQ"], ["updated_at", "2019-10-01 22:38:28.341053"], ["id", 1]]