W8D1/reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <input type="hidden" name="post[sub_ids][]" value="">
  <% Sub.all.each do |sub| %>