W8D1/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save!
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hi"], ["url", ""], ["content", "bye"], ["user_id", 1], ["created_at", "2019-10-07 21:51:09.707713"], ["updated_at", "2019-10-07 21:51:09.707713"]]

  def update
    @post = Post.find_by(id: params[:id])
    if @post.update!(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "yayyy <3 <3 <3 lisa is awesome"], ["updated_at", "2019-10-07 22:28:52.321563"], ["id", 12]]

  def edit_check
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]