W8D1/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "come look at all these beautiful doggiess <3 <3 <3"], ["updated_at", "2019-10-07 19:05:18.706419"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update!(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def mod_check
    @sub = Sub.find_by(id: params[:id])