W8D1/reddit_clone/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: SecureRandom.urlsafe_base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vYSeQ0pqdtIyX9YspCEi7g"], ["updated_at", "2019-10-07 18:36:50.078674"], ["id", 1]]